Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing.Insert Method
 Inserts a new single part drawing. Views are added according to the View Creation rules of the standard file. A drawing can be inserted only when there is no active drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
CannotInsertDrawingException | Thrown if inserting a drawing when another drawing is active.
See Also
Reference
SinglePartDrawing Class
Tekla.Structures.Drawing Namespace